"""Дан список students с информацией о результатах контрольной работы по курсу "Алгоритмы и программирование" в 2021 году. Каждый элемент списка содержит ФИО студента, номер
группы и оценку за контрольную работу. Вам необходимо: - Вывести список студентов, писавших контрольную в порядке возрастания полученных баллов. Должны выводиться ФИО, номер группы и полученная оценка в заданном порядке через запятую, каждый результат на отдельной строке. После этого нужно вывести список
студентов, не писавших контрольную. - Реализовать быстрый поиск информации о студенте по имени или отчетству. Должны выводиться ФИО, номер группы и полученная оценка в заданном порядке через запятую,
каждый результат на отдельной строке."""
